app/Http/Controllers/Admin/OwnersController.php

    public function destroy($id)
    {
        Owner::findOrFail($id)->delete();   //  勝手にソフトデリートとなる
---
delete from `owners` where `id` = 1
select * from `owners` where `owners`.`deleted_at` is not null and `owners`.`id` = '1' limit 1